<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\District;
use App\Models\Province;

class DistrictSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $districts = [
            'کابل' => ['بگرامی', 'خیرخانه', 'کوتل خیرخانه', 'ده سبز', 'مکروریان'],
            'قندهار' => ['ارغنداب', 'دامان', 'ژیری', 'پنجوایی', 'شاه ولی کوت'],
            'هرات' => ['گذره', 'کرخ', 'انجیل', 'اوبه', 'کشک رباط سنگی'],
            'مزار شریف' => ['دهدادی', 'کشنده', 'چمتال', 'بلخ', 'کلدار'],
            'کندز' => ['امام صاحب', 'خان آباد', 'علی آباد', 'چاردره', 'گل تپه'],
            'ننگرهار' => ['بهسود', 'کامه', 'سرخ رود', 'دره نور', 'گوشته'],
            'غزنی' => ['جغتو', 'مقر', 'قره باغ', 'گیرو', 'ناهور'],
            'بغلان' => ['ده صلاح', 'باغ دره', 'دوشی', 'خوست و فرنگ', 'نهرین'],
            'بدخشان' => ['ارگو', 'بهارک', 'شغنان', 'کشم', 'خاش'],
            'خوست' => ['اسماعیل‌خیل', 'گربز', 'قلندر', 'صابری', 'زازی میدان'],
            'فاریاب' => ['قیصار', 'شیرین تگاب', 'گرزیوان', 'پشتون‌کوت', 'بلچراغ'],
            'پروان' => ['سید خیل', 'شینواری', 'بگرام', 'سالنگ', 'سرخ پارسا'],
            'لغمان' => ['مهترلام', 'قرغه‌یی', 'الیگ', 'الینگ', 'بادپخ'],
            'بامیان' => ['یکاولنگ', 'شیبر تو', 'سیغان', 'کهمرد', 'پنجاب'],
            'تخار' => ['فرخار', 'چاه آب', 'دشت قلعه', 'رستاق', 'کلفگان'],
            'پکتیکا' => ['زرمت', 'سروبی', 'گیان', 'برمل', 'یوسف خیل'],
            'سمنگان' => ['حضرت سلطان', 'رؤب', 'دره صوف بالا', 'دره صوف پایان', 'کوهستانات'],
            'وردک' => ['بهسود', 'دایمیرداد', 'نرخ', 'جلریز', 'جغتو'],
            'نیمروز' => ['چخانسور', 'خاشرود', 'کنک', 'چاربرجک', 'چخانسور'],
            'بادغیس' => ['آبکمری', 'قادیس', 'مقر', 'غورماچ', 'موری چاق'],
            'ارزگان' => ['چور', 'دهراود', 'چنارتو', 'خاص ارزگان', 'گیزاب'],
            'کاپیسا' => ['حصه اول', 'حصه دوم', 'کوه‌صافی', 'نجراب', 'تگاب'],
            'جوزجان' => ['خواجه دوکوه', 'آقچه', 'فیض آباد', 'منگجک', 'مردیان'],
            'غور' => ['دولینه', 'شهرک', 'لعل و سرجنگل', 'دولتیار', 'تولک'],
            'سرپل' => ['شیبر', 'آقچه بالا', 'آقچه پایین', 'آقچه وسط', 'آقچه نو'],
            'زابل' => ['کندی بالا', 'کندی پایین', 'کندی وسط', 'کندی نو', 'کندی کهنه'],
            'نورستان' => ['کامدیش', 'باری‌کوت', 'نورگرام', 'دوآب', 'وانت وایگل'],
            'پنجشیر' => ['عنابه', 'پریان', 'رخا', 'بازارک', 'دره'],
            'کنر' => ['خوگیانی بالا', 'خوگیانی پایین', 'خوگیانی وسط', 'خوگیانی نو', 'خوگیانی کهنه'],
            'بلخ' => ['دهدادی', 'نهر شاهی', 'کلدار', 'چهاربولک', 'چمتال'],
            'دایکندی' => ['آیبک', 'دره صوف', 'حضرت سلطان', 'روی دوآب', 'خیر دره'],
            'هلمند' => ['لشکرگاه', 'گرمسیر', 'نادعلی', 'کجکی', 'سنگین'],
            'لوگر' => ['پل علم', 'محمد آغا', 'چرخ', 'خوشی', 'برکی برک'],
            'فراه' => ['بالابلوک', 'پشت‌رود', 'انار دره', 'گلستان', 'بکوا'],
        ];


        foreach ($districts as $province => $districtList) {
            $province = Province::where('name', $province)->first();
            if ($province) {
                foreach ($districtList as $districtName) {
                    District::create([
                        'name' => $districtName,
                        'province_id' => $province->id,
                    ]);
                }
            }
        }
    }
}
